In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv('insurance.csv')

In [4]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [5]:
df1=df.copy()
df2=df.copy()
df3=df.copy()
df4=df.copy()
df5=df.copy()

In [6]:
x=df.drop('charges', axis=1)

In [7]:
x.head()

   age     sex     bmi  children smoker     region
0   19  female  27.900         0    yes  southwest
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest

In [10]:
y=df['charges']

In [11]:
y.head()

0    16884.92400
1     1725.55230
2     4449.46200
3    21984.47061
4     3866.85520
Name: charges, dtype: float64

In [12]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

# 1) Label Encoder

In [13]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
le=LabelEncoder()

In [19]:
df1.region=le.fit_transform(df['region'])

In [20]:
df1.head()

   age     sex     bmi  children smoker  region      charges
0   19  female  27.900         0    yes       3  16884.92400
1   18    male  33.770         1     no       2   1725.55230
2   28    male  33.000         3     no       2   4449.46200
3   33    male  22.705         0     no       1  21984.47061
4   32    male  28.880         0     no       1   3866.85520

In [21]:
le.classes_

array(['northeast', 'northwest', 'southeast', 'southwest'], dtype=object)

In [22]:
le.transform(le.classes_)

array([0, 1, 2, 3])

# Label Encoding with Label mapping

In [24]:
df.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [25]:
label_mapping = {'southwest': 1, 'southeast': 2, 'northwest': 3, 'northeast': 0}

In [26]:
label_mapping

{'southwest': 1, 'southeast': 2, 'northwest': 3, 'northeast': 0}

In [27]:
label_mapping.keys()

dict_keys(['southwest', 'southeast', 'northwest', 'northeast'])

In [28]:
label_mapping.values()

dict_values([1, 2, 3, 0])

In [29]:
df2.region=[label_mapping[region] for region in df2.region]

In [30]:
df2.head()

   age     sex     bmi  children smoker  region      charges
0   19  female  27.900         0    yes       1  16884.92400
1   18    male  33.770         1     no       2   1725.55230
2   28    male  33.000         3     no       2   4449.46200
3   33    male  22.705         0     no       3  21984.47061
4   32    male  28.880         0     no       3   3866.85520

# 2) One Hot Encoder

In [31]:
df4=pd.read_csv('insurance.csv')

In [32]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [33]:
pd.get_dummies(df4['region']).head()

   northeast  northwest  southeast  southwest
0      False      False      False       True
1      False      False       True      False
2      False      False       True      False
3      False       True      False      False
4      False       True      False      False

In [34]:
dummy = pd.get_dummies(df4['region'], drop_first=True, prefix='region', prefix_sep='_' )

In [35]:
df4.drop('region', axis=1, inplace=True)

In [36]:
df4.head()

   age     sex     bmi  children smoker      charges
0   19  female  27.900         0    yes  16884.92400
1   18    male  33.770         1     no   1725.55230
2   28    male  33.000         3     no   4449.46200
3   33    male  22.705         0     no  21984.47061
4   32    male  28.880         0     no   3866.85520

# 3) Ordinal Encoder

In [37]:
df5.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [38]:
df5.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [39]:
from sklearn.preprocessing import OrdinalEncoder

In [40]:
ordinal = OrdinalEncoder(categories = [['southwest', 'southeast', 'northwest','northeast']])

In [43]:
df5.region = ordinal.fit_transform(df5[['region']])

In [44]:
df5.head()

   age     sex     bmi  children smoker  region      charges
0   19  female  27.900         0    yes     0.0  16884.92400
1   18    male  33.770         1     no     1.0   1725.55230
2   28    male  33.000         3     no     1.0   4449.46200
3   33    male  22.705         0     no     2.0  21984.47061
4   32    male  28.880         0     no     2.0   3866.85520